Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.InteractionHandlerImports
The Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.InteractionHandlerImports class imports all native functions related to interactions.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.InteractionHandlerImports.GetUserInputs(System.Int32@,System.Int32@,System.Boolean)
Exports the get user inputs command.
pressedKey: The pressed key.
inputModifiers: The input modifiers.
fromHandle: Whether to gets the inputs for the selected handles.
Returns: True on success; otherwise, false.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.InteractionHandlerImports.SetHitDmHandleId(System.Int32)
Exports the set handle id command.
handleId: The id to set for the latest handle hit test.
Returns: Greater than 0 on success.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.InteractionHandlerImports.ConsumeInputReceivedEvent
Notifies when the Tekla.Structures.DirectManipulation.Adapter.EventRegistry.InputEvents.InputReceived event has been consumed.
Returns: True on success; otherwise, false.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.InteractionHandlerImports.SetDeleteSelectedObjectsConsumed(Tekla.Structures.DirectManipulation.Adapter.Native.dotBool)
Notifies when the Tekla.Structures.DirectManipulation.Adapter.EventRegistry.InteractionEvents.DeleteSelectedObjects event has been consumed.
requestConsumed: Indicates whether the request was consumed.
Returns: True on success; otherwise, false.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.InteractionHandlerImports.GetScreenCoordinate(Tekla.Structures.Internal.dotPoint_t,Tekla.Structures.Internal.dotPoint_t@)
Gets the screen coordinate for the point in Zkit world.
location: The location.
point: The point.
Returns: The screen coordinate for the location in Zkit world.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.InteractionHandlerImports.DotExportGetUserInputs(System.Int32@,System.Int32@,Tekla.Structures.DirectManipulation.Adapter.Native.dotBool)
Exports the get user inputs command.
pressedKey: The pressed key.
inputModifiers: The input modifiers.
fromHandle: Whether to gets the inputs for the selected handles.
Returns: True on success; otherwise, false.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.InteractionHandlerImports.DotExportSetHitDmHandleId(System.Int32)
Exports the set handle id command.
handleId: The id to set for the latest handle hit test.
Returns: Greater than 0 on success.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.InteractionHandlerImports.DotExportConsumeInputReceivedEvent
Notifies when the Tekla.Structures.DirectManipulation.Adapter.EventRegistry.InputEvents.InputReceived event has been consumed.
Returns: True on success; otherwise, false.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.InteractionHandlerImports.DotExportSetDeleteSelectedObjectsConsumed(Tekla.Structures.DirectManipulation.Adapter.Native.dotBool)
Notifies when the Tekla.Structures.DirectManipulation.Adapter.EventRegistry.InteractionEvents.DeleteSelectedObjects event has been consumed.
requestConsumed: Indicates whether the request was consumed.
Returns: True on success; otherwise, false.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.InteractionHandlerImports.DotExportGetScreenCoordinate(Tekla.Structures.Internal.dotPoint_t,Tekla.Structures.Internal.dotPoint_t@)
Gets the screen coordinate for the location in Zkit world.
location: The location.
point: The point.
Returns: True on success; otherwise, false.